import numpy as np

# создание матрицы X
X = np.array([[1, 22, 60],
              [1, 23, 61],
              [1, 24, 62],
              [1, 25, 63],
              [1, 26, 64],
              [1, 27, 65],
              [1, 28, 66],
              [1, 29, 67],
              [1, 30, 68],
              [1, 31, 69],
              [1, 32, 70],
              [1, 33, 71]])

# создание вектора Y
Y = np.array([[13.5],
              [14.2],
              [14.8],
              [15.4],
              [15.9],
              [16.5],
              [17.1],
              [17.6],
              [18.2],
              [18.6],
              [19.0],
              [19.5]])

# вычисление оценок уравнения регрессии
A = np.linalg.pinv(X.T.dot(X)).dot(X.T).dot(Y)

# проверка вектора A
Y_predicted = X.dot(A)

print("Оценки уравнения регрессии (вектор A):")
print(A)
print("\nПроверка оценок уравнения регрессии:")
print("Y из исходных данных:")
print(Y.T)
print("Предсказанные значения Y:")
print(Y_predicted.T)